# Импорт необходимых модулей
import random  # Для генерации случайного числа
from datetime import datetime  # Для измерения времени игры


# Основной класс игры
class NumberGuesser:
    # Метод конструктор
    def __init__(self):
        self.secret = random.randint(1, 30)  # генерируем случайное число которое нужно угадать
        self.attempts = 0  # счетчик попыток начинается с 0
        # Запоминаем текущее время как время начала игры
        self.start_time = datetime.now()

    # Основной метод игры
    def play(self):
        # Выводим приветственное сообщение с правилами
        print("Угадай число от 1 до 30!")

        # Бесконечный цикл, пока число не будет угадано
        while True:
            # Получаем ввод от пользователя
            guess = input("Введите число: ")

            # Проверяем, что введены только цифры
            if not guess.isdigit():
                print("Надо вводить только числа!")
                continue  # Переходим к следующему вост. цикла

            # Преобразуем введенную строку в число
            guess = int(guess)
            # Увеличиваем счетчик попыток на 1
            self.attempts += 1

            # Сравниваем введенное число с загаданным
            if guess < self.secret:
                print("Больше!")  # Число меньше загаданного
            elif guess > self.secret:
                print("Меньше!")  # Число больше загаданного
            else:
                # Если числа равны - вычисляем время игры в секундах
                time_spent = (datetime.now() - self.start_time).seconds
                # Сохраняем статистику
                self._save_stats(time_spent)
                # Выводим сообщение о победе
                print(f"Число {self.secret} угадано за {self.attempts} попыток и {time_spent} секунд")
                break  # Выходим из цикла

    # метод для сохранения статистики
    def _save_stats(self, time):
        # Открываем файл для добавления записей (append)
        with open("logs.txt", "a") as f:
            # Записываем статистику в формате: Число, Попытки, Время
            f.write(f"Число: {self.secret}, Попытки: {self.attempts}, Время: {time} сек\n")


# Стандартная проверка для запуска кода как самостоятельной программы
if __name__ == "__main__":
    # Создаем экземпляр игры
    game = NumberGuesser()
    # Запускаем игровой процесс
    game.play()